src/slides/modelo.org
#+TITLE: Título do Slide
#+AUTHOR: Seu Nome
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js@4/
#+REVEAL_THEME: night
#+REVEAL_PLUGINS: (highlight)
#+OPTIONS: toc:nil num:nil

* Introdução
#+ATTR_REVEAL: :frag (appear)
- Este é um slide modelo
- Use para criar suas apresentações
- Revela.js via Org Mode export

#+REVEAL: split
** Continuação do slide
Slides longos podem ser quebrados com =#+REVEAL: split=

#+begin_quote
Citações ficam destacadas assim.
#+end_quote

* Código e Blocos

#+BEGIN_SRC python
def hello():
    print("Hello, world!")
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
- Código é syntax-highlighted
- Suporta várias linguagens

* Tabelas

| Coluna 1 | Coluna 2 |
|----------+----------|
| Dado A   | Dado B   |
| Dado C   | Dado D   |

#+REVEAL: split
** Tabelas com fragmentos
#+ATTR_REVEAL: :frag (appear)
- Linhas aparecem uma a uma
- Use =:frag (appear)= no ATTR_REVEAL acima da lista

* Links Úteis

- [[https://revealjs.com/][Reveal.js Documentation]]
- [[https://orgmode.org/][Org Mode Manual]]
- [[https://github.com/yjwen/org-reveal][org-reveal repo]]

* Demonstração

#+ATTR_REVEAL: :frag (appear)
- Demo ao vivo de =ask-ai=
- Como usar o terminal com IA
- Perguntas interativas

#+REVEAL: split
** Perguntando para IA
#+BEGIN_SRC bash
# Exemplo de uso
ask-ai "O que é um embedding?"
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
- IA responde com base no contexto
- Histórico é mantido na sessão

* Conclusão

#+ATTR_REVEAL: :frag (appear)
1. Org Mode + Reveal.js = slides poderosos
2. Exportação simples via Emacs
3. Suporta código, tabelas, fragments

#+begin_quote
Obrigado pela atenção!
#+end_quote

** Perguntas?
Fim da apresentação.