slides/modelo.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Título do Slide</title>
<meta name="author" content="Seu Nome"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Título do Slide</h1><p class="subtitle"></p>
<h2 class="author">Seu Nome</h2><p class="date">Created: 2026-06-05 Fri 18:09</p>
</section>
<section>
<section id="slide-org5f0b6ce">
<h2 id="org5f0b6ce">Introdução</h2>
<ul>
<li class="fragment appear">Este é um slide modelo</li>
<li class="fragment appear">Use para criar suas apresentações</li>
<li class="fragment appear">Revela.js via Org Mode export</li>

</ul>

</section>
<section id="slide-org5f0b6ce-split">
</section>
<section id="slide-org1cf7101">
<h3 id="org1cf7101">Continuação do slide</h3>
<p>
Slides longos podem ser quebrados com <code>#+REVEAL: split</code>
</p>

<blockquote >
<p>
Citações ficam destacadas assim.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org8288870">
<h2 id="org8288870">Código e Blocos</h2>
<div class="org-src-container">

<pre   ><code class="python" >def hello():
    print("Hello, world!")
</code></pre>
</div>

<ul>
<li class="fragment appear">Código é syntax-highlighted</li>
<li class="fragment appear">Suporta várias linguagens</li>

</ul>
</section>
</section>
<section>
<section id="slide-org1f3f8d5">
<h2 id="org1f3f8d5">Tabelas</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Coluna 1</th>
<th scope="col" class="org-left">Coluna 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Dado A</td>
<td class="org-left">Dado B</td>
</tr>

<tr>
<td class="org-left">Dado C</td>
<td class="org-left">Dado D</td>
</tr>
</tbody>
</table>

</section>
<section id="slide-org1f3f8d5-split">
</section>
<section id="slide-orgee95368">
<h3 id="orgee95368">Tabelas com fragmentos</h3>
<ul>
<li class="fragment appear">Linhas aparecem uma a uma</li>
<li class="fragment appear">Use <code>:frag (appear)</code> no ATTR<sub>REVEAL</sub> acima da lista</li>

</ul>
</section>
</section>
<section>
<section id="slide-orge7a6426">
<h2 id="orge7a6426">Links Úteis</h2>
<ul>
<li><a href="https://revealjs.com/">Reveal.js Documentation</a></li>
<li><a href="https://orgmode.org/">Org Mode Manual</a></li>
<li><a href="https://github.com/yjwen/org-reveal">org-reveal repo</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org539f988">
<h2 id="org539f988">Demonstração</h2>
<ul>
<li class="fragment appear">Demo ao vivo de <code>ask-ai</code></li>
<li class="fragment appear">Como usar o terminal com IA</li>
<li class="fragment appear">Perguntas interativas</li>

</ul>

</section>
<section id="slide-org539f988-split">
</section>
<section id="slide-orgf60f115">
<h3 id="orgf60f115">Perguntando para IA</h3>
<div class="org-src-container">

<pre   ><code class="bash" ># Exemplo de uso
ask-ai "O que é um embedding?"
</code></pre>
</div>

<ul>
<li class="fragment appear">IA responde com base no contexto</li>
<li class="fragment appear">Histórico é mantido na sessão</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgbf34c5f">
<h2 id="orgbf34c5f">Conclusão</h2>
<ol>
<li class="fragment appear">Org Mode + Reveal.js = slides poderosos</li>
<li class="fragment appear">Exportação simples via Emacs</li>
<li class="fragment appear">Suporta código, tabelas, fragments</li>

</ol>

<blockquote >
<p>
Obrigado pela atenção!
</p>
</blockquote>
</section>
<section id="slide-orgaaa52a8">
<h3 id="orgaaa52a8">Perguntas?</h3>
<p>
Fim da apresentação.</p>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
